Michal-Baculak/lightning-STM32F303RE/F303RE_LED_Demo/Core/Inc/PCA9685.h
/*
 * PCA9685.h
 *
 *  Created on: Oct 11, 2025
 *      Author: Michal
 */

#ifndef INC_PCA9685_H_
#define INC_PCA9685_H_

#define PCA9685_MODE1_REGADDR         0x00
#define PCA9685_MODE2_REGADDR         0x01
#define PCA9685_SUBADR1_REGADDR       0x02
#define PCA9685_SUBADR2_REGADDR       0x03
#define PCA9685_SUBADR3_REGADDR       0x04
#define PCA9685_ALLCALLADR_REGADDR    0x05

#define PCA9685_LED0_ON_L_REGADDR     0x06
#define PCA9685_LED0_ON_H_REGADDR     0x07
#define PCA9685_LED0_OFF_L_REGADDR    0x08
#define PCA9685_LED0_OFF_H_REGADDR    0x09

#define PCA9685_LED1_ON_L_REGADDR     0x0A
#define PCA9685_LED1_ON_H_REGADDR     0x0B
#define PCA9685_LED1_OFF_L_REGADDR    0x0C
#define PCA9685_LED1_OFF_H_REGADDR    0x0D

#define PCA9685_LED2_ON_L_REGADDR     0x0E
#define PCA9685_LED2_ON_H_REGADDR     0x0F
#define PCA9685_LED2_OFF_L_REGADDR    0x10
#define PCA9685_LED2_OFF_H_REGADDR    0x11

#define PCA9685_LED3_ON_L_REGADDR     0x12
#define PCA9685_LED3_ON_H_REGADDR     0x13
#define PCA9685_LED3_OFF_L_REGADDR    0x14
#define PCA9685_LED3_OFF_H_REGADDR    0x15

#define PCA9685_LED4_ON_L_REGADDR     0x16
#define PCA9685_LED4_ON_H_REGADDR     0x17
#define PCA9685_LED4_OFF_L_REGADDR    0x18
#define PCA9685_LED4_OFF_H_REGADDR    0x19

#define PCA9685_LED5_ON_L_REGADDR     0x1A
#define PCA9685_LED5_ON_H_REGADDR     0x1B
#define PCA9685_LED5_OFF_L_REGADDR    0x1C
#define PCA9685_LED5_OFF_H_REGADDR    0x1D

#define PCA9685_LED6_ON_L_REGADDR     0x1E
#define PCA9685_LED6_ON_H_REGADDR     0x1F
#define PCA9685_LED6_OFF_L_REGADDR    0x20
#define PCA9685_LED6_OFF_H_REGADDR    0x21

#define PCA9685_LED7_ON_L_REGADDR     0x22
#define PCA9685_LED7_ON_H_REGADDR     0x23
#define PCA9685_LED7_OFF_L_REGADDR    0x24
#define PCA9685_LED7_OFF_H_REGADDR    0x25

#define PCA9685_LED8_ON_L_REGADDR     0x26
#define PCA9685_LED8_ON_H_REGADDR     0x27
#define PCA9685_LED8_OFF_L_REGADDR    0x28
#define PCA9685_LED8_OFF_H_REGADDR    0x29

#define PCA9685_LED9_ON_L_REGADDR     0x2A
#define PCA9685_LED9_ON_H_REGADDR     0x2B
#define PCA9685_LED9_OFF_L_REGADDR    0x2C
#define PCA9685_LED9_OFF_H_REGADDR    0x2D

#define PCA9685_LED10_ON_L_REGADDR    0x2E
#define PCA9685_LED10_ON_H_REGADDR    0x2F
#define PCA9685_LED10_OFF_L_REGADDR   0x30
#define PCA9685_LED10_OFF_H_REGADDR   0x31

#define PCA9685_LED11_ON_L_REGADDR    0x32
#define PCA9685_LED11_ON_H_REGADDR    0x33
#define PCA9685_LED11_OFF_L_REGADDR   0x34
#define PCA9685_LED11_OFF_H_REGADDR   0x35

#define PCA9685_LED12_ON_L_REGADDR    0x36
#define PCA9685_LED12_ON_H_REGADDR    0x37
#define PCA9685_LED12_OFF_L_REGADDR   0x38
#define PCA9685_LED12_OFF_H_REGADDR   0x39

#define PCA9685_LED13_ON_L_REGADDR    0x3A
#define PCA9685_LED13_ON_H_REGADDR    0x3B
#define PCA9685_LED13_OFF_L_REGADDR   0x3C
#define PCA9685_LED13_OFF_H_REGADDR   0x3D

#define PCA9685_LED14_ON_L_REGADDR    0x3E
#define PCA9685_LED14_ON_H_REGADDR    0x3F
#define PCA9685_LED14_OFF_L_REGADDR   0x40
#define PCA9685_LED14_OFF_H_REGADDR   0x41

#define PCA9685_LED15_ON_L_REGADDR    0x42
#define PCA9685_LED15_ON_H_REGADDR    0x43
#define PCA9685_LED15_OFF_L_REGADDR   0x44
#define PCA9685_LED15_OFF_H_REGADDR   0x45

#define PCA9685_ALL_LED_ON_L_REGADDR  0xFA
#define PCA9685_ALL_LED_ON_H_REGADDR  0xFB
#define PCA9685_ALL_LED_OFF_L_REGADDR 0xFC
#define PCA9685_ALL_LED_OFF_H_REGADDR 0xFD

#define PCA9685_PRE_SCALE_REGADDR     0xFE
#define PCA9685_TESTMODE_REGADDR      0xFF


#define PCA9685_MODE1_DEFAULT 0b00100001 // enable AI (Auto Increment) and ALLCALL (Addressing all LEDs at the same time)
#include "stm32f3xx_hal.h"

typedef struct
{
	I2C_HandleTypeDef* hi2c;
	uint8_t address;

} hPCA9685;

uint8_t PCA9685_PWM_write(hPCA9685 *hpca, uint8_t pin, uint16_t val);

/**
  * @brief  Read an amount of data in blocking mode from a specific memory address
  * @param  hi2c Pointer to a I2C_HandleTypeDef structure that contains
  *                the configuration information for the specified I2C.
  * @param addr The bit unshifted address according to the datasheet
  * @returns 	0x01 - Device is unresponsive
  *				0x02 - Device failed to set the default operation mode
  */
uint8_t PCA9685_PWM_init(hPCA9685 *hpca, I2C_HandleTypeDef *hi2c, uint8_t addr);
uint8_t PCA9685_LEDX_off(hPCA9685 *hpca, uint8_t pin);
uint8_t PCA9685_LEDX_on(hPCA9685 *hpca, uint8_t pin);

uint8_t PCA9685_LED0_off(hPCA9685 *hpca);
uint8_t PCA9685_LED0_on(hPCA9685 *hpca);
#endif /* INC_PCA9685_H_ */
